; domain
(define (domain satellite-advanced)

; ==========================================================
; SATELLITE DOMAIN - CLEAN FINAL VERSION
;
; MODELLO CORRETTO:
; - qualità esplicita (photo-hd / photo-sd)
; - goal esprime cosa deve essere inviato e in quale qualità
; - memoria è vincolo fisico (non logico)
; - nessun predicato inutile o ridondante
; - planner decide sequenza take/send
; ==========================================================

(:requirements
    :typing
    :fluents
    :negative-preconditions
    :conditional-effects
    :equality
)

; ==========================================================
; TYPES
; ==========================================================

(:types
    object direction
)

; ==========================================================
; DIREZIONI COSTANTI
; ==========================================================

(:constants
    n ne e se s sw w nw - direction
)

; ==========================================================
; PREDICATES
; ==========================================================

(:predicates

    ; orientamento satellite
    (pointing ?d - direction)

    ; visibilità oggetti
    (visible ?o - object ?d - direction)

    ; stato oggetti
    (taken ?o - object)
    (sent ?o - object)

    ; qualità foto (decisa dall’azione)
    (photo-hd ?o - object)
    (photo-sd ?o - object)

    ; direzioni
    (next-right ?from ?to - direction)
    (next-left ?from ?to - direction)
)

; ==========================================================
; FUNCTIONS
; ==========================================================

(:functions
    (energy)
    (memory-used)
    (memory-capacity)
    (photo-count)
)

; ==========================================================
; ROTATE RIGHT
; ==========================================================

(:action rotate-right
    :parameters (?from ?to - direction)

    :precondition (and
        (pointing ?from)
        (next-right ?from ?to)
        (>= (energy) 1)
    )

    :effect (and
        (not (pointing ?from))
        (pointing ?to)
        (decrease (energy) 1)
    )
)

; ==========================================================
; ROTATE LEFT
; ==========================================================

(:action rotate-left
    :parameters (?from ?to - direction)

    :precondition (and
        (pointing ?from)
        (next-left ?from ?to)
        (>= (energy) 1)
    )

    :effect (and
        (not (pointing ?from))
        (pointing ?to)
        (decrease (energy) 1)
    )
)

; ==========================================================
; TAKE PICTURE HD
; ==========================================================

(:action take-picture-hd
    :parameters (?o - object ?d - direction)

    :precondition (and
        (pointing ?d)
        (visible ?o ?d)
        (not (taken ?o))
        (not (sent ?o))
        (>= (energy) 2)
        (< (photo-count) 2)
        (<= (+ (memory-used) 10) (memory-capacity))
    )

    :effect (and
        (taken ?o)
        (photo-hd ?o)
        (increase (memory-used) 10)
        (increase (photo-count) 1)
        (decrease (energy) 2)
    )
)

; ==========================================================
; TAKE PICTURE SD
; ==========================================================

(:action take-picture-sd
    :parameters (?o - object ?d - direction)

    :precondition (and
        (pointing ?d)
        (visible ?o ?d)
        (not (taken ?o))
        (not (sent ?o))
        (>= (energy) 2)
        (< (photo-count) 2)
        (<= (+ (memory-used) 3) (memory-capacity))
    )

    :effect (and
        (taken ?o)
        (photo-sd ?o)
        (increase (memory-used) 3)
        (increase (photo-count) 1)
        (decrease (energy) 2)
    )
)

; ==========================================================
; SEND
; ==========================================================

(:action send
    :parameters (?o - object)

    :precondition (and
        (pointing n)
        (taken ?o)
        (not (sent ?o))
        (>= (energy) 2)
    )

    :effect (and
        (sent ?o)
        (not (taken ?o))
        (decrease (photo-count) 1)
        (decrease (energy) 2)

        (when (photo-hd ?o)
            (decrease (memory-used) 10)
        )

        (when (photo-sd ?o)
            (decrease (memory-used) 3)
        )
    )
)

)

; problem
(define (problem satellite-easy)

(:domain satellite-advanced)

(:objects
    star1 noise1 - object
)

(:init

    (pointing n)

    (visible star1 e)
    (visible noise1 e)

    (= (memory-used) 0)
    (= (memory-capacity) 20)

    (= (energy) 20)
    (= (photo-count) 0)

    (next-right n ne)
    (next-right ne e)
    (next-right e se)
    (next-right se s)
    (next-right s sw)
    (next-right sw w)
    (next-right w nw)
    (next-right nw n)

    (next-left n nw)
    (next-left nw w)
    (next-left w sw)
    (next-left sw s)
    (next-left s se)
    (next-left se e)
    (next-left e ne)
    (next-left ne n)

)

(:goal
    (and
        (sent star1)
        (photo-hd star1)
    )
)

(:metric minimize (energy))

)

; plan
1. (rotate-left n nw)
   deleted: (pointing n)
   added: (pointing nw)
   changed: (energy) from 20 to 19
   goals met: 0 of 2
2. (rotate-left nw w)
   deleted: (pointing nw)
   added: (pointing w)
   changed: (energy) from 19 to 18
   goals met: 0 of 2
3. (rotate-left w sw)
   deleted: (pointing w)
   added: (pointing sw)
   changed: (energy) from 18 to 17
   goals met: 0 of 2
4. (rotate-right sw w)
   deleted: (pointing sw)
   added: (pointing w)
   changed: (energy) from 17 to 16
   goals met: 0 of 2
5. (rotate-left w sw)
   deleted: (pointing w)
   added: (pointing sw)
   changed: (energy) from 16 to 15
   goals met: 0 of 2
6. (rotate-right sw w)
   deleted: (pointing sw)
   added: (pointing w)
   changed: (energy) from 15 to 14
   goals met: 0 of 2
7. (rotate-left w sw)
   deleted: (pointing w)
   added: (pointing sw)
   changed: (energy) from 14 to 13
   goals met: 0 of 2
8. (rotate-right sw w)
   deleted: (pointing sw)
   added: (pointing w)
   changed: (energy) from 13 to 12
   goals met: 0 of 2
9. (rotate-left w sw)
   deleted: (pointing w)
   added: (pointing sw)
   changed: (energy) from 12 to 11
   goals met: 0 of 2
10. (rotate-right sw w)
   deleted: (pointing sw)
   added: (pointing w)
   changed: (energy) from 11 to 10
   goals met: 0 of 2
11. (rotate-left w sw)
   deleted: (pointing w)
   added: (pointing sw)
   changed: (energy) from 10 to 9
   goals met: 0 of 2
12. (rotate-left sw s)
   deleted: (pointing sw)
   added: (pointing s)
   changed: (energy) from 9 to 8
   goals met: 0 of 2
13. (rotate-left s se)
   deleted: (pointing s)
   added: (pointing se)
   changed: (energy) from 8 to 7
   goals met: 0 of 2
14. (rotate-left se e)
   deleted: (pointing se)
   added: (pointing e)
   changed: (energy) from 7 to 6
   goals met: 0 of 2
15. (take-picture-hd star1 e)
   added: (taken star1) (photo-hd star1)
   changed: (memory-used) from 0 to 10, (photo-count) from 0 to 1, (energy) from 6 to 4
   goals met: 1 of 2
16. (rotate-left e ne)
   deleted: (pointing e)
   added: (pointing ne)
   changed: (energy) from 4 to 3
   goals met: 1 of 2
17. (rotate-left ne n)
   deleted: (pointing ne)
   added: (pointing n)
   changed: (energy) from 3 to 2
   goals met: 1 of 2
18. (send star1)
   deleted: (taken star1)
   added: (sent star1)
   changed: (photo-count) from 1 to 0, (energy) from 2 to 0, (memory-used) from 10 to 0
   goals met: 2 of 2
